; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v5)
             (pred_5 ?v3 ?v2)
             (pred_4 ?v12 ?v2)
             (pred_11 ?v10 ?v12 )
	     (pred_3 ?v12)
             (pred_12 ?v4)
             (pred_1 ?v3)
             (pred_8 ?v2)
             (pred_7 ?v12)
             (pred_6 ?v3)
             (pred_10 ?v12)
             (pred_2 ))



(:action op_3
:parameters (?v11 ?v8 ?v1 ?v13)
:precondition (and (pred_12 ?v11) (pred_12 ?v8) (pred_1 ?v1) (pred_8 ?v13)
          (pred_9 ?v11 ?v8) (pred_5 ?v1 ?v13)
                   (pred_4 ?v8 ?v13) (pred_3 ?v11) 
                   (pred_7 ?v8) (pred_6 ?v1))
:effect (and  (pred_10 ?v8) (not (pred_7 ?v8))))


(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_12 ?v11) (pred_12 ?v6)
               (pred_3 ?v11) (pred_9 ?v11 ?v6) (pred_10 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v11))))

(:action op_2
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_1 ?v1) 
                  (pred_3 ?v11) (pred_11 ?v1 ?v11) (pred_2 ))
:effect (and (pred_6 ?v1)
   (not (pred_11 ?v1 ?v11)) (not (pred_2 ))))


(:action op_5
:parameters (?v11 ?v7 ?v9)
:precondition (and (pred_12 ?v11) (pred_1 ?v7) (pred_1 ?v9)
                  (pred_3 ?v11) (pred_6 ?v9) (pred_11 ?v7 ?v11))
:effect (and (pred_6 ?v7) (pred_11 ?v9 ?v11)
        (not (pred_6 ?v9)) (not (pred_11 ?v7 ?v11))))

(:action op_4
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_1 ?v1) 
                  (pred_3 ?v11) (pred_6 ?v1))
:effect (and (pred_2 ) (pred_11 ?v1 ?v11) (not (pred_6 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_13 obj_06 obj_21 obj_05 obj_15 obj_08 obj_27 obj_19 obj_11 obj_10 obj_17 obj_04 obj_30 obj_22 obj_12 obj_02 obj_18 obj_29 obj_24 obj_14 obj_20 obj_01 obj_07 obj_09
    obj_23 obj_28
    obj_03 obj_25 obj_16
    )

    (:init
       (pred_2)

       (pred_12 obj_26)
       (pred_12 obj_13)
       (pred_12 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_30)
       (pred_12 obj_22)
       (pred_12 obj_12)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_29)
       (pred_12 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_07)
       (pred_12 obj_09)
       (pred_8 obj_23)
       (pred_8 obj_28)
       (pred_1 obj_03)
       (pred_1 obj_25)
       (pred_1 obj_16)

       (pred_9 obj_26 obj_15)
       (pred_9 obj_26 obj_13)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_13 obj_26)
       (pred_9 obj_06 obj_27)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_21 obj_19)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_21)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_26)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_27)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_27 obj_04)
       (pred_9 obj_27 obj_19)
       (pred_9 obj_27 obj_06)
       (pred_9 obj_27 obj_08)
       (pred_9 obj_19 obj_30)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_19 obj_21)
       (pred_9 obj_19 obj_27)
       (pred_9 obj_11 obj_22)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_30)
       (pred_9 obj_04 obj_27)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_30 obj_29)
       (pred_9 obj_30 obj_22)
       (pred_9 obj_30 obj_19)
       (pred_9 obj_30 obj_04)
       (pred_9 obj_22 obj_24)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_22 obj_30)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_29 obj_07)
       (pred_9 obj_29 obj_24)
       (pred_9 obj_29 obj_30)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_24 obj_09)
       (pred_9 obj_24 obj_22)
       (pred_9 obj_24 obj_29)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_07 obj_09)
       (pred_9 obj_07 obj_29)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_09 obj_24)
       (pred_9 obj_09 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_4  obj_01 obj_23)
       (pred_4  obj_12 obj_28)
       (pred_4  obj_17 obj_23)
       (pred_10 obj_26)
       (pred_10 obj_13)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_27)
       (pred_10 obj_19)
       (pred_10 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_04)
       (pred_10 obj_30)
       (pred_10 obj_22)
       (pred_10 obj_02)
       (pred_10 obj_18)
       (pred_10 obj_29)
       (pred_10 obj_24)
       (pred_10 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_07)
       (pred_10 obj_09)

       (pred_5  obj_03 obj_23)
       (pred_5  obj_25 obj_28)
       (pred_5  obj_16 obj_28)
       (pred_11 obj_03 obj_24)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_16 obj_30)
       (pred_3 obj_24)
    )

    (:goal (and
       (pred_11 obj_03 obj_30)
    ))
(:constraints
  (always (not (pred_3 obj_22)))
)
)

; plan
1. (op_2 obj_24 obj_03)
   deleted: (pred_11 obj_03 obj_24) (pred_2)
   added: (pred_6 obj_03)
   goals met: 0 of 1
2. (op_1 obj_24 obj_29)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_29)
   goals met: 0 of 1
3. (op_1 obj_29 obj_30)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_30)
   goals met: 0 of 1
4. (op_5 obj_30 obj_16 obj_03)
   deleted: (pred_6 obj_03) (pred_11 obj_16 obj_30)
   added: (pred_6 obj_16) (pred_11 obj_03 obj_30)
   goals met: 1 of 1
